{"data":{"allFormFieldsJson":{"edges":[{"node":{"content":"Employment income. Box 14 of all T4 slips."}},{"node":{"content":"Commissions included on line 101. Box 42 of all T4 slips."}},{"node":{"content":"Wage loss replacement contributions. See line 101 in the guide."}},{"node":{"content":"Other employment income."}},{"node":{"content":"Old age security pension. Box 18 of the T4A(OAS) slip."}},{"node":{"content":"Canada pension plan or Quebec pension plan benefits. Box 20 of the T4A(P) slip."}},{"node":{"content":"Disability benefits included on line 114. Box 16 of the T4A(P) slip."}},{"node":{"content":"Other pensions and superannuation. See line 115 in the guide and complete the Worksheet for Schedule 1 for line 314."}},{"node":{"content":"Elected split-pension amount. Get and complete Form T1032."}},{"node":{"content":"Universal child care benefit. See the RC62 slip."}},{"node":{"content":"Universal child care benefit amount designated to a dependant."}},{"node":{"content":"Employment insurance and other benefits. Box 14 of the T4E slip."}},{"node":{"content":"Taxable amount of dividends, eligible and other than eligible, from taxable Canadian corporations. Complete the Worksheet for the return."}},{"node":{"content":"Taxable amount of dividends other than eligible dividends, included on line 120, from taxable Canadian corporations."}},{"node":{"content":"Interest and other investment income. Complete the Worksheet for the return."}},{"node":{"content":"Net partnership income. Limited or non-active partners only."}},{"node":{"content":"Registered disability savings plan income. Box 131 of the T4A slip."}},{"node":{"content":"Rental income. Gross."}},{"node":{"content":"Rental income. Net."}},{"node":{"content":"Taxable capital gains. Complete Schedule 3."}},{"node":{"content":"Support payments received. Total."}},{"node":{"content":"Support payments received. Taxable amount."}},{"node":{"content":"Registered retirement savings plan income from all T4RSP slips."}},{"node":{"content":"Other income. Specify."}},{"node":{"content":"Other income."}},{"node":{"content":"Self-employment income. Business income. Gross."}},{"node":{"content":"Self-employment income. Business income. Net."}},{"node":{"content":"Self-employment income. Professional income. Gross."}},{"node":{"content":"Self-employment income. Professional income. Net."}},{"node":{"content":"Self-employment income. Commission income. Gross."}},{"node":{"content":"Self-employment income. Commission income. Net."}},{"node":{"content":"Self-employment income. Farming income. Gross."}},{"node":{"content":"Self-employment income. Farming income. Net."}},{"node":{"content":"Self-employment income. Fishing income. Gross."}},{"node":{"content":"Self-employment income. Fishing income. Net."}},{"node":{"content":"Workers' compensation benefits. Box 10 of the T5007 slip."}},{"node":{"content":"Social assistance payments."}},{"node":{"content":"Net federal supplements. Box 21 of the T4A(OAS) slip."}},{"node":{"content":"Add lines 144, 145, and 146. See line 250 on this return. Instance 1."}},{"node":{"content":"Add lines 144, 145, and 146. See line 250 on this return. Instance 2."}},{"node":{"content":"This is your total income. Add lines 101, 104 to 143, and 147."}},{"node":{"content":"Enter your total income from line 150."}},{"node":{"content":"Pension adjustment. Box 52 of all T4 slips and box 034 of all T4A slips."}},{"node":{"content":"Registered pension plan deduction. Box 20 of all T4 slips and box 032 of all T4A slips."}},{"node":{"content":"Registered retirement savings plan and pooled registered pension plan deduction. See Schedule 7 and attach receipts."}},{"node":{"content":"Pooled registered pension plan employer contributions. Amount from your pooled registered pension plan contribution receipts."}},{"node":{"content":"Deduction for elected split-pension amount. Get and complete Form T1032."}},{"node":{"content":"Annual union, professional, or like dues. Receipts and box 44 of all T4 slips."}},{"node":{"content":"Universal child care benefit repayment. Box 12 of all RC62 slips."}},{"node":{"content":"Child care expenses. Get and complete Form T778."}},{"node":{"content":"Disability supports deduction. Get and complete Form T929."}},{"node":{"content":"Business investment loss. Gross."}},{"node":{"content":"Business investment loss. Allowable deduction."}},{"node":{"content":"Moving expenses. Get and complete Form T1-M."}},{"node":{"content":"Support payments made. Total."}},{"node":{"content":"Support payments made. Allowable deduction."}},{"node":{"content":"Carrying charges and interest expenses. Complete the Worksheet for the return."}},{"node":{"content":"Deduction for Canada pension plan or Quebec pension plan contributions on self-employment and other earnings. Complete Schedule 8 or get and complete Form RC381, whichever applies."}},{"node":{"content":"Exploration and development expenses. Get and complete Form T1229."}},{"node":{"content":"Other employment expenses."}},{"node":{"content":"Clergy residence deduction. Get and complete Form T1223."}},{"node":{"content":"Other deductions. Specify."}},{"node":{"content":"Other deductions."}},{"node":{"content":"Add lines 207 to 224, 229, 231, and 232. Instance 1."}},{"node":{"content":"Add lines 207 to 224, 229, 231, and 232. Instance 2."}},{"node":{"content":"This is your net income before adjustments. Line 150 minus line 233. If negative, enter 0."}},{"node":{"content":"Social benefits repayment. If you reported income at line 119 and the amount at line 234 is greater than $64,625, see the repayment chart on the back of your T4E slip. If you reported income on lines 113 or 146, and the amount at line 234 is greater than $75,910, complete the chart for line 235 on the Worksheet for the return. Otherwise, enter 0."}},{"node":{"content":"This is your net income. Line 234 minus line 235. If negative, enter 0."}},{"node":{"content":"Canadian Forces personnel and police deduction. Box 43 of all T4 slips."}},{"node":{"content":"Security options deductions."}},{"node":{"content":"Other payments deduction. Claim the amount from line 147, unless it includes an amount at line 146. If so, see line 250 in the guide."}},{"node":{"content":"Limited partnership losses of other years."}},{"node":{"content":"Non-capital losses of other years."}},{"node":{"content":"Net capital losses of other years."}},{"node":{"content":"Capital gains deduction. Get and complete Form T657."}},{"node":{"content":"Northern residents deductions. Get and complete Form T2222."}},{"node":{"content":"Additional deductions. Specify."}},{"node":{"content":"Additional deductions."}},{"node":{"content":"Add lines 244 to 256. Instance 1."}},{"node":{"content":"Add lines 244 to 256. Instance 2."}},{"node":{"content":"This is your taxable income. Line 236 minus line 257. If negative, enter 0."}},{"node":{"content":"Net federal tax. Enter the amount from line 61 of Schedule 1. Attach Schedule 1, even if the result is 0."}},{"node":{"content":"Canada pension plan contributions payable on self-employment and other earnings. Complete Schedule 8 or get and complete Form RC381, whichever applies."}},{"node":{"content":"Employment insurance premiums payable on self-employment and other eligible earnings. Complete Schedule 13."}},{"node":{"content":"Social benefits repayment. Amount from line 235."}},{"node":{"content":"Provincial or territorial tax. Attach Form 428, even if the result is 0."}},{"node":{"content":"This is your total payable. Add lines 420, 421, 430, 422, and 428."}},{"node":{"content":"Total income tax deducted. Amounts from all Canadian slips."}},{"node":{"content":"Refundable Quebec abatement. See line 440 in the guide."}},{"node":{"content":"Canada pension plan overpayment. See line 308 in the guide."}},{"node":{"content":"Employment insurance overpayment. See line 312 in the guide."}},{"node":{"content":"Refundable medical expense supplement. Complete the Worksheet for the return."}},{"node":{"content":"Working income tax benefit. Complete Schedule 6."}},{"node":{"content":"Refund of investment tax credit. Get and complete Form T2038(IND)."}},{"node":{"content":"Part XII.2 trust tax credit. Box 38 of all T3 slips and box 209 of all T5013 slips."}},{"node":{"content":"Employee and partner goods and services tax/harmonized sales tax rebate. Get and complete Form GST370."}},{"node":{"content":"Eligible educator school supply tax credit. Supplies expenses. Maximum $1,000."}},{"node":{"content":"Line 468 multiplied by fifteen percent."}},{"node":{"content":"Tax paid by instalments."}},{"node":{"content":"Provincial or territorial credits. Complete Form 479 if it applies."}},{"node":{"content":"These are your total credits. Add lines 437 to 457, and 469 to 479. Instance 1."}},{"node":{"content":"These are your total credits. Add lines 437 to 457, and 469 to 479. Instance 2."}},{"node":{"content":"This is your refund or balance owing. Line 435 minus line 482."}},{"node":{"content":"Refund."}},{"node":{"content":"Balance owing."}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}